Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: །ལྷ་མོ་སློབ་དཔོན་ལུང་སྟོན་པ་བྲམ་ཟེ་ཀཽཎྜི་ནྱ་ཡང་ང་འདས་པའི་འོག་ལོ་བརྒྱ་ཉི་ཤུ་ལོན་པ་ན་མོའུ་རྱའི་རིགས་ཞེས་བྱ་བ་ཕྱེད་ཀྱི་འཁོར་ལོས་སྒྱུར་བའི་རིགས་སུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: Goddess, moreover, when a hundred and twenty years have passed after I am gone, the brahmin Kauṇḍinya, the master grammarian, will be born within a half-cakravartin family called Maurya.

source: ལྷ་མོ་མོའུ་རྱའི་རིགས་སུ་སྐྱེས་ནས་ཀྱང་ཕྱེད་ཀྱི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་ཏེ།
en: Goddess, after having been born within the Maurya family, he will become a half-cakravartin king.

source: ལྷ་མོ་མོའུ་རྱའི་རིགས་ཀྱི་རྒྱལ་པོའི་མཆོག་ཏུ་འགྱུར་ལ་ཆོས་ཀྱི་ལུགས་ཇི་ལྟ་བ་བཞིན་དུ་རྒྱལ་པོ་བྱེད་པར་འགྱུར་རོ།
en: Goddess, when he has become this supreme king of the Maurya family, he will perform his kingly duties in accordance with the traditions of Dharma.”

source: །དེ་ནས་ལྷ་མོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེའི་མིང་ཅི་སྐད་ཅེས་བགྱི་བར་གཟུང་བར་བགྱི།
en: Then the goddess addressed the Bhagavān, saying, “Bhagavān, what name will he have?”

source: བཀའ་སྩལ་པ། ལྷ་མོ་དགེ་བསྙེན་གྱི་རྒྱལ་པོ་མྱ་ངན་མེད་ཅེས་བྱ་བར་འགྱུར་ཏེ།
en: He replied, “Goddess, this layman king will be named Aśoka.

source: ལྷ་མོ་ཕྱེད་ཀྱི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་མྱ་ངན་མེད་ཅེས་བྱ་བ་དེས་ཆོས་ཀྱི་བསྟན་བཅོས་པའི་སེང་གེའི་སྒྲ་ཆེན་པོ་ཐོག་མར་སྒྲོགས་པར་བྱེད་ཅིང་མངོན་པར་མཆོད་པར་བྱེད་དོ།
en: Goddess, this half-cakravartin king named Aśoka will sound the foremost great lion’s roar of the treatises of Dharma and will make illustrious offerings to the Dharma teachings.”

source: །དེ་ནས་ལྷ་མོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །སེམས་ཅན་ཐམས་ཅད་ལ་སྨན་པའི་སླད་དུ་རྒྱལ་པོ་བརྩོན་འགྲུས་ཆེན་པོའི་ཀླུ་ལུང་བསྟན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: Then the goddess asked, “As medicine for all sentient beings, I beseech the Bhagavān to explain the prophecy concerning King Great Diligent Nāga.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྷ་མོ་ཁྱོད་ཉིད་ཐོག་མར་ཇེ་ལུང་བསྟན་གྱིས་ཉོན་ཅིག །
en: The Bhagavān replied, “Goddess, first listen to the prophecy concerning yourself.”

source: དེ་ནས་ལྷ་མོ་ངོ་ཚ་ནས་མགོ་སྨད་དོ།
en: At this, the goddess became ashamed and bowed her head.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྷ་མོ་ལེགས་སོ་ལེགས་སོ།
en: The Bhagavān replied, “Excellent, goddess, excellent!

source: །ངོ་ཚ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་མཆོག་ཡིན་གྱིས་ལྷ་མོ་ཁྱོད་ལེགས་སོ།
en: Shame is the foremost among all dharmas. Goddess, excellent!

source: །ལྷ་མོ་ཁྱོད་ནི་རྒྱལ་པོ་བརྩོན་འགྲུས་ཆེན་པོའི་ཀླུའི་བཙུན་མོ་དམ་པར་གྱུར་ཏོ།
en: Goddess, you were King Great Diligent Nāga’s queen Sacred.

source: །སྤྲིན་ཆེན་པོའི་མདོ་ལས་འབྱུང་བ་ཟབ་མོ་བསྟན་པའི་ཆུའི་རྒྱ་མཚོའི་དུས་ཚོད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་ཡུལ་ལ་ལྟོས།
en: See the domain of the samādhi of the tide of the deep, constant ocean, which arises from The Great Cloud!

source: ལྷ་མོ་ང་འདས་པའི་འོག་ཏུ་ཁྱོད་དགེ་བའི་རྩ་བ་དང་སྨོན་ལམ་གྱི་ཁྱད་པར་དེས། བེ་ཡི་ཞེས་བྱ་བ་དེའི་གྲོང་ན་གནས་པའི་རྗེའུ་རིགས་སུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: Goddess, after I am gone, due to your virtuous roots and your special vows, you will be born into the merchant class in the city called Veyi.

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་བཙུན་མོའི་གཟུགས་ཐོབ་ནས་ངེས་པ་དང་། ཉེ་བར་གནས་པ་དང་། བསླབ་པའི་གཞི་བཅས་པ་བླངས་ནས་གྲོང་ཁྱེར་དང་།
en: Having obtained the form of the queen of a cakravartin king, you will take up renunciation, abiding in discipline, and the basic precepts of training.

source: གྲོང་རྡལ་དང་བཅས་པར་འབྱོར་ཅིང་རྒྱས་ལ་བུད་མེད་ཀྱི་གཟུགས་ཀྱིས་རྒྱལ་སྲིད་མངོན་པར་སྤྱོད་དེ།
en: Then, you will rule over that great, prosperous city and its environs in the form of a woman.

source: མུ་སྟེགས་ཅན་ངན་པའི་ཚོགས་ཐམས་ཅད་མངོན་པར་འདུལ་ཞིང་དམ་པའི་ཆོས་ཀྱི་སྒྲོན་མ་རབ་ཏུ་འབར་བར་བྱེད་ལ་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་མཆོད་པ་བྱེད་དེ།
en: You will discipline the negative host of non-Buddhists and cause the lamp of the sacred Dharma to blaze brightly, making offerings to the teachings of the Bhagavān.

source: ཆོས་ཀྱི་སྒྲ་ཆེན་པོ་བསྒྲགས་ནས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པས་རང་གི་རྒྱལ་སྲིད་ཡང་དག་པར་སྲུང་ཞིང་ཡོངས་སུ་སྐྱོང་བར་བྱེད་ལ་འཇིག་རྟེན་དང་འཐུན་པར་བྱ་བ་སྤྱོད་པར་འགྱུར་ཏེ།
en: Having sounded the great roar of the Dharma, you will completely guard and protect your kingdom by engaging in the conduct of a bodhisattva, and you will act in a manner that engages harmoniously with the world. “

source: ལྷ་མོ་རྒྱལ་པོ་བརྩོན་འགྲུས་ཆེན་པོའི་ཀླུའི་གཟི་བརྗིད་ཀྱི་མཐུས་ཁྱོད་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མངོན་པར་རྩེ་བར་གྱུར་པ་ཡིན་གྱིས།
en: Goddess, through the power of King Great Diligent Nāga’s majesty, you have become one who plays within the inconceivable.

source: ལྷ་མོ་ཆོས་ཀྱི་རྒྱལ་པོ་བརྩོན་འགྲུས་ཆེན་པོའི་ཀླུ་ལ་རྗེས་སུ་ཡི་རང་བར་གྱིས་ཤིག །
en: Therefore, Goddess, you should rejoice in the Dharma king Great Diligent Nāga!

source: རྒྱལ་པོ་བརྩོན་འགྲུས་ཆེན་པོའི་ཀླུ་དེ་ནི་ངའི་ཉན་ཐོས་ཀྱི་མཆོག་ལིད་ཚ་བཱི་གཞོན་ནུ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་མཐོང་ན་དགའ་བ་འདི་ཡིན་ནོ།
en: This King Great Diligent Nāga is now my supreme disciple, the Licchavi youth Admired by All Worlds.”

source: །ལྷ་མོས་གསོལ་པ། སེམས་ཅན་ཐམས་ཅད་ལ་སྨན་པའི་སླད་དུ་སྐྱེས་བུ་ཆེན་པོ་མིང་ཆེན་ལུང་བསྟན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: The goddess said, “I beseech the Bhagavān to explain the prophecy concerning this great being Great Name, to serve as medicine for all sentient beings.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྷ་མོ་མིང་ཆེན་ལུང་བསྟན་པ་ཉོན་ལ་ཇི་སྲིད་འཚོའི་བར་དུ་བསྙེན་བཀུར་གྱིས་ཤིག་དང་།
en: The Bhagavān replied, “Goddess, listen to this prophecy concerning Great Name, and venerate him for as long as you live.

source: ཁྱོད་ཀྱིས་མིང་ཆེན་གྱི་ཆོ་འཕྲུལ་དང་། ཡོན་ཏན་ཆེན་པོ་མངོན་དུ་ཐོབ་པར་འགྱུར་རོ།
en: You will attain the magical powers and virtuous qualities of Great Name.

source: །ལྷ་མོ་མིང་ཆེན་ནི་སངས་རྒྱས་དང་འདྲའོ།
en: Goddess, Great Name is just like a buddha.

source: །ལྷ་མོ་མིང་ཆེན་ནི་སངས་རྒྱས་ཀྱི་སྐུའི་ཕྱེད་དང་འདྲའོ།
en: Goddess, Great Name is like one half of the body of a buddha.”

source: །ལྷ་མོས་གསོལ་པ། བཅོམ་ལྡན་འདས་མིང་ཆེན་འདི་ལྟ་བུ་ལ་ཇི་སྲིད་འཚོའི་བར་དུ་ཇི་ལྟར་བསྙེན་བཀུར་བགྱི།
en: The goddess asked, “Bhagavān, how should one venerate one such as Great Name for as long as one lives?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མིང་ཆེན་འདི་ནི་དེ་བཞིན་གཤེགས་པ་ཀླུ་རིགས་སྒྲོན་མའི་ཉན་ཐོས་ཡིན་ཏེ།
en: The Bhagavān replied, “Great Name was a disciple of the tathāgata Lamp of the Nāga Family.

source: ངའི་ཉན་ཐོས་ངའི་ལུས་ཀྱི་ཕྱེད་དང་འདྲ་བ་ངལ་བྱས་པ་གཟོ་བ་སྟེ།
en: He is just like one of my disciples, and one half of my own body, and he has repaid his gratitude to me.

source: ད་ལྟར་གྱི་འོད་སྲུང་ཆེན་པོ་འདི་ཡིན་གྱིས་ལྷ་མོ་ཇི་སྲིད་འཚོའི་བར་དུ་བསྙེན་བཀུར་གྱིས་ཤིག །
en: Now he is the present-day Mahākāśyapa. Goddess, you should venerate him for as long as you live.”

source: དེ་ནས་དེའི་ཚེ་འཁོར་ཆེན་པོའི་ནང་ནས། ལྷའི་བུ་དབྱུག་མཆོག་ཅེས་བྱ་བ་འཁོར་སྟོང་དང་ལྡན་པས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ།
en: At that time, a devaputra named Supreme Club set forth from the great assembly with a retinue of a thousand other devaputras.

source: །སྐྲ་རྩེ་ཙམ་གྱིས་རྒྱ་མཚོ་ཀུན། །བས་བར་གཏུག་ཏུ་ནུས་ལགས་ཀྱི། །གཟུགས་མང་མངའ་བའི་ཡོན་ཏན་མཚོ། །ཚིག་ཙམ་གྱིས་ནི་བརྗོད་མི་ནུས།
en: After making offerings to the Bhagavān, he spoke this verse: “Even if one could drain all the oceans Using just a hair’s tip, One would be unable to express by mere words The ocean of qualities of the myriad forms you have assumed.”

source: །བསྟན་པ་འདི་བཤད་པ་ན་ལྷའི་བུ་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དག་གིས་ཐོས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: Upon hearing him speak these words, all the hundreds of thousands of devaputras produced the aspiration to attain unsurpassed, complete, and perfect awakening.

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་སློབ་དཔོན་ལུང་སྟོན་པ་བྲམ་ཟེ་ཀཽཎྜི་ནྱ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །སློབ་དཔོན་ལུང་སྟོན་པ་ཀཽཎྜི་ནྱ་ཁྱོད་ཀྱིས་རྙེད་པ་ལེགས་པར་རྙེད་ཀྱིས་མངོན་པར་དད་པར་གྱིས་ཤིག །
en: At that time, the Bhagavān addressed the brahmin Kauṇḍinya, the master grammarian, saying, “Master grammarian Kauṇḍinya, since you have obtained that which is well obtained, you should have great faith.

source: མ་འོངས་པའི་དུས་ན་སེམས་ཅན་རྣམས་བསྲུང་བའི་ཕྱིར་ཁྱོད་ལས་གླེངས་ཏེ་སྲུང་བའི་མཚན་ཉིད་བཤད་དེ།
en: In the future, you will perform actions for the benefit of all sentient beings. I will now discuss these and explain how you should uphold them. “

source: སློབ་དཔོན་ལུང་སྟོན་པ་ཀཽཎྜི་ནྱ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ལྷོ་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་བཅུའི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་མངོན་པར་དང་བ་ཞེས་བྱ་བ་ཡོད་དེ།
en: Master grammarian Kauṇḍinya, to the south of this buddhafield, beyond as many world systems as there are grains of sand in ten Ganges Rivers, there is a world system called Manifest Clarity.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བློ་གྲོས་མི་ཟད་པ་ཞེས་བྱ་བ་ད་ལྟར་འཚོ་ཞིང་གཞེས་ཏེ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: There is a tathāgata, foe-destroyer, complete and perfect buddha named Inexhaustible Intellect, who lives and dwells there now, teaching the Dharma. “

source: །སློབ་དཔོན་ལུང་སྟོན་པ་ཀཽཎྜི་ནྱ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ལྷོ་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་ཉི་ཤུའི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་མཉམ་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: Master grammarian Kauṇḍinya, to the south of this buddhafield, beyond as many world systems as there are grains of sand in twenty Ganges Rivers, there is a world system called All Equal.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་རྒྱལ་མཚན་ཞེས་བྱ་བ་ད་ལྟར་འཚོ་ཞིང་གཞེས་ཏེ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: There is a tathāgata, foe-destroyer, complete and perfect buddha named Precious Victory Banner, who lives and dwells there now, teaching the Dharma. “

source: །སློབ་དཔོན་ལུང་སྟོན་པ་ཀཽཎྜི་ནྱ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ལྷོ་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་སུམ་ཅུའི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཡིད་བདེ་བ་ཞེས་བྱ་བ་ཡོད་དེ།
en: Master grammarian Kauṇḍinya, to the south of this buddhafield, beyond as many world systems as there are grains of sand in thirty Ganges Rivers, there is a world system called Joyful Mind.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དྲི་མ་མེད་པའི་སྙིང་པོ་ཞེས་བྱ་བ་ད་ལྟར་འཚོ་ཞིང་གཞེས་ཏེ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: There is a tathāgata, foe-destroyer, complete and perfect buddha named Essence of Stainless Light, who lives and dwells there now, teaching the Dharma. “

source: །སློབ་དཔོན་ལུང་སྟོན་པ་ཀཽཎྜི་ནྱ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ལྷོ་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་བཞི་བཅུའི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་རབ་ཏུ་དགའ་བ་ཞེས་བྱ་བ་ཡོད་དེ།
en: Master grammarian Kauṇḍinya, to the south of this buddhafield, beyond as many world systems as there are grains of sand in forty Ganges Rivers, there is a world system called Utter Joy.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་འཕྲུལ་པས་དང་བར་བྱེད་པའི་གྲགས་པ་ཞེས་བྱ་བ་ད་ལྟར་འཚོ་ཞིང་གཞེས་ཏེ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: There is a tathāgata, foe-destroyer, complete and perfect buddha named Renowned for Delightful Magical Manifestations, who lives and dwells there now, teaching the Dharma. “

source: །སློབ་དཔོན་ལུང་སྟོན་པ་ཀཽཎྜི་ནྱ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ལྷོ་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་ལྔ་བཅུའི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་དམ་པའི་ཆོས་ལ་དགའ་མོས་ཞེས་བྱ་བ་ཡོད་དེ།
en: Master grammarian Kauṇḍinya, to the south of this buddhafield, beyond as many world systems as there are grains of sand in fifty Ganges Rivers, there is a world system called Joyful Faith in the Sacred Dharma.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྤྲིན་གྱི་བསྲུངས་ཞེས་བྱ་བ་ད་ལྟར་འཚོ་ཞིང་གཞེས་ཏེ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: There is a tathāgata, foe-destroyer, complete and perfect buddha named Cloud Protector, who lives and dwells there now, teaching the Dharma. “

source: །སློབ་དཔོན་ལུང་སྟོན་པ་ཀཽཎྜི་ནྱ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ལྷོ་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་དྲུག་ཅུའི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་མུ་སྟེགས་ཐམས་ཅད་ཀྱི་གནས་ཞེས་བྱ་བ་ཡོད་དེ།
en: Master grammarian Kauṇḍinya, to the south of this buddhafield, beyond as many world systems as there are grains of sand in sixty Ganges Rivers, there is a world system called Abode of All Non-Buddhists.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སེང་གེ་རྣམ་པར་རོལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་ད་ལྟར་འཚོ་ཞིང་གཞེས་ཏེ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: There is a tathāgata, foe-destroyer, complete and perfect buddha named King of Lion’s Play, who lives and dwells there now, teaching the Dharma. “

source: །སློབ་དཔོན་ལུང་སྟོན་པ་ཀཽཎྜི་ནྱ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ལྷོ་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་བདུན་ཅུའི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་མེ་ཏོག་གི་རྒྱལ་མཚན་ཞེས་བྱ་བ་ཡོད་དེ།
en: Master grammarian Kauṇḍinya, to the south of this buddhafield, beyond as many world systems as there are grains of sand in seventy Ganges Rivers, there is a world system called Flower Victory Banner.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལྷུན་པོའི་རྒྱལ་པོ་མངོན་པར་འཕགས་ཞེས་བྱ་བ་ད་ལྟར་འཚོ་ཞིང་གཞེས་ཏེ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: There is a tathāgata, foe-destroyer, complete and perfect buddha named Superior King of Sumeru, who lives and dwells there now, teaching the Dharma. “

source: །སློབ་དཔོན་ལུང་སྟོན་པ་ཀཽཎྜི་ནྱ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ལྷོ་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་བརྒྱད་ཅུའི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་རིན་ཆེན་སྐྱོང་ཞེས་བྱ་བ་ཡོད་དེ།
en: Master grammarian Kauṇḍinya, to the south of this buddhafield, beyond as many world systems as there are grains of sand in eighty Ganges Rivers, there is a world system called Jewel Protector.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དམ་པའི་ཆོས་ཀུན་ཏུ་སྲུང་བའི་ཏོག་ཏུ་གྱུར་པ་ཞེས་བྱ་བ་ད་ལྟར་འཚོ་ཞིང་གཞེས་ཏེ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: There is a tathāgata, foe-destroyer, complete and perfect buddha named Pinnacle of Guarding All Sacred Dharmas, who lives and dwells there now, teaching the Dharma. “

source: །སློབ་དཔོན་ལུང་སྟོན་པ་ཀཽཎྜི་ནྱ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ནི་ཡོངས་སུ་དག་པ་སྟེ།
en: Master grammarian Kauṇḍinya, all these complete and perfect tathāgata, foe-destroyer, complete and perfect buddhas have completely purified their buddhafields.

source: ལག་མཐིལ་ལྟར་མཉམ་ལ། རི་དང་རྡོ་མེད་ཅིང་། གསེག་མ་དང་། བོང་བ་དང་། སྡོང་དུམ་དང་།
en: Their buddhafields are flat like the palm of one’s hand and without mountains, boulders, pebbles, dirt, sticks, and thorns.

source: ཚེར་མ་མེད་དེ། འཇམ་ཞིང་ཀ་ཙ་ལིན་དིའི་གོས་ལྟར་རེག་ན་འཇམ་ལ།
en: They are smooth and soft like kācalindi cloth and free from the five degeneracies.

source: སྙིགས་མ་ལྔ་དང་བྲལ་ཞིང་བུད་མེད་མེད་ལ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་མེད་ཅིང་དེ་དག་གི་མིང་ཡང་མེད་པ་ཡིན་ནོ།
en: There are no women, śrāvakas, or pratyekabuddhas—even these names do not exist there.

source: །སེམས་ཅན་དེ་དག་ཀྱང་ཐེག་པ་ཆེན་པོ་ལ་རབ་ཏུ་དགའ་བ་དང་། ཐེག་པ་ཆེན་པོས་མངོན་པར་རྩེ་བ་དང་། ཐེག་པ་ཆེན་པོ་ལ་དད་པའི་སེམས་ཐོབ་པ་ཤ་སྟག་གོ།
en: All the sentient beings there utterly delight in the Great Vehicle, play with the Great Vehicle, and have gained faith only in the Great Vehicle. “

source: །སློབ་དཔོན་ལུང་སྟོན་པ་ཀཽཎྜི་ནྱ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གི་མཚན་རྣམས་ཐོས་ནས་འཛིན་ཏམ། ཀུན་ཆུབ་པར་བྱེད་དམ། འཆང་ངམ། ཀློག་གམ། གཞན་དག་ལ་ཡང་རྒྱས་པར་ཡང་དག་པར་སྟོན་ན་སློབ་དཔོན་ལུང་སྟོན་པ་ཀཽཎྜི་ནྱ་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་སེམས་ཅན་དམྱལ་བར་འགྲོ་བ་འམ། དུད་འགྲོའི་སྐྱེ་གནས་དང་། ལྷ་མ་ཡིན་གྱི་རིས་སུ་སྐྱེ་བར་འགྱུར་བ་ནི་སྐབས་མ་ཡིན་ཞིང་མི་སྲིད་དེ། དེ་ནི་གནས་མེད་དོ། །
en: Master grammarian Kauṇḍinya, if a noble son or daughter who has correctly entered into the Great Vehicle hears the names of these tathāgata, foe-destroyer, complete and perfect buddhas and, having heard them, upholds them, realizes them, bears them in mind, recites them, or correctly teaches them widely to others, then, master grammarian Kauṇḍinya, for those noble sons and daughters to be reborn in the hell realms, the animal realms, or among the race of asuras is impossible and would never happen.

source: སློབ་དཔོན་ལུང་སྟོན་པ་ཀཽཎྜི་ནྱ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་གིས་ད་ལྟར་ང་ལས་ཏིང་ངེ་འཛིན་གྱི་སྒོ་འདི་ཐོས་ལ། ཕྱི་མའི་ཚེ་ཡང་ཏིང་ངེ་འཛིན་འདི་ཐོས་ན་སྨོད་པར་འགྱུར་བ་ནི་སྐབས་མ་ཡིན་ཞིང་མི་སྲིད་དེ་ནི་གནས་མེད་དོ།
en: Master grammarian Kauṇḍinya, for a bodhisattva mahāsattva to hear about the samādhi gateways from me now and to then, in their next life, become contemptuous when hearing about these samādhi gateways is impossible and would never happen. “

source: །སློབ་དཔོན་ལུང་སྟོན་པ་ཀཽཎྜི་ནྱ་དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་མཚན་རྣམས་འཆང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལ་དུག་གིས་ཚུགས་པའམ། མཚོན་འབབ་པའམ། ཆུར་འཆི་བའམ། མེས་ཚིག་པར་འགྱུར་བ་འམ། དེ་ལ་རྒྱལ་པོ་འམ། ཆོམ་རྐུན་ནམ། མིའམ། མི་མ་ཡིན་པ་འམ། ཀླུ་འམ། གནོད་སྦྱིན་ནམ། སེང་གེ་འམ། སྲོག་ཆགས་གདུག་པ་འམ། སྟག་གམ། ཁྱི་འམ། སྤྱང་ཀི་འམ། སྦྲུལ་ལམ། སྡིག་པ་རྣམས་ཀྱི་བར་ཆད་བྱ་བ་འམ། ཚངས་པར་སྤྱད་པ་སྤྱོད་པ་དང་། ཁ་ཐོན་བྱེད་པ་དང་། ལྷུང་བཟེད་དང་། ཆོས་གོས་ལ་བར་ཆད་བྱེད་པར་འགྱུར་བ་ནི་སྐབས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་ལ་དེ་ནི་གནས་མེད་དེ། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་མ་གཏོགས་སོ། །
en: Master grammarian Kauṇḍinya, for bodhisattva mahāsattvas who bear in mind the names of those tathāgatas, all such things as the following will be impossible: damage from poison, harm from weapons, death by water, and burning by fire; the creation of obstacles by kings, robbers, humans, nonhumans, nāgas, yakṣas, lions, venomous insects, tigers, dogs, wolves, snakes, and all manner of negative forces; and further obstacles to engaging in pure conduct, practicing recitation, begging, or wearing the robes of Dharma practitioners. Unless they occur due to the ripening of past karma, these will never happen. “

source: སློབ་དཔོན་ལུང་སྟོན་པ་ཀཽཎྜི་ནྱ་གཞན་ཡང་དགེ་སློང་ངམ། དགེ་སློང་མ་འམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་གང་ལ་ལས་གཞན་མུ་སྟེགས་ཅན་སྤྱོད་པ་པའམ། ཀུན་ཏུ་རྒྱུ་བ་རྣམས་ལ་དཔྱས་པའམ། བསྟིང་བ་འམ། བགད་པ་འམ། གཞན་དང་འཐུན་པར་བྱ་བ་འམ། རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་འདོད་པའི་ཕྱིར་ཡང་རུང་སྟེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གི་མཚན་རྣམས་ཐོས་ན་ཡང་ངན་སོང་ངན་འགྲོར་སྐྱེ་བར་འགྱུར་བ་དེ་ནི་གནས་མེད་དོ།། །།
en: Master grammarian Kauṇḍinya, moreover, if there are monks, nuns, laymen, or laywomen who deride, criticize, or laugh at other non-Buddhist practitioners or wandering mendicants, whether going along with others or for the sake of gain, respect, or praise, then if they hear the names of these tathāgata, foe-destroyer, complete and perfect buddhas, it will be impossible for them to be reborn in unpleasant realms.”

source: དེ་ནས་སློབ་དཔོན་ལུང་སྟོན་པ་ཀཽཎྜི་ནྱས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གང་དག་གི་རྣ་ལམ་དུ་གྲགས་པ་དེ་དག་ཀྱང་རྙེད་པ་ལེགས་པར་རྙེད་པ་ལགས་ན་ཐོས་ནས་མོས་པ་དང་མོས་ནས་ལུང་འབོག་པ་དང་། བརྗོད་པར་བགྱིད་པ་དང་། འཆང་བར་བགྱིད་པ་དག་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ་ཏེ།
en: At that time, the master grammarian Kauṇḍinya prostrated, touching his head to the Bhagavān’s feet, and then asked, “If those who come to hear these Dharma teachings obtain that which is well obtained, what need is there to mention those who, having heard it, develop belief, receive instruction, proclaim it, and bear it in mind?

source: སེམས་ཅན་དེ་དག་ནི་ཆོས་ཀྱི་དགའ་བའི་གཏེར་རྙེད་པ་ལགས་སོ།
en: Sentient beings such as these obtain the treasury of delighting in the Dharma.

source: །གང་དག་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འདི་དག་གི་མཚན་རྣམས་ལག་ན་འཆང་བར་བགྱིད་པ་དེ་དག་གི་ཁྱིམ་ན་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་བཞུགས་ལགས་སོ།
en: For those who hold in their hands the names of these tathāgata, foe-destroyer, complete and perfect buddhas, all the tathāgatas will come to live in their homes.

source: །བཅོམ་ལྡན་འདས་གང་དུ་དེ་བཞིན་གཤེགས་པ་འདི་དག་གི་མཚན་ཐོས་ནས་ཡིད་ཆེས་པར་བགྱིད་པའི་ས་ཕྱོགས་དེ་དག་ནི་རྡོ་རྗེའི་རང་བཞིན་དུ་འགྱུར་རོ།
en: Bhagavān, wherever people hear the names of these tathāgatas and develop trust in them, the ground in that place will come to have the nature of a vajra.

source: །བཅོམ་ལྡན་འདས་གང་དག་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འདི་དག་གི་མཚན་རྣམས་ཐོས་ནས་ཡིད་ཆེས་པར་བགྱིད་པར་དེ་དག་ཀྱང་རྡོ་རྗེ་ལྟ་བུར་འགྱུར་ཞིང་མི་ཕྱེད་པའི་བཟོད་པ་ཡང་ཐོབ་པར་འགྱུར་རོ།
en: Bhagavān, whoever hears the names of these tathāgatas and develops trust in them will transform and attain the vajra nature, obtaining unwavering patience.

source: །བཅོམ་ལྡན་འདས་གང་དག་ཡིད་ཆེས་པར་དཀའ་བའི་མཚན་འདི་དག་ལ་དད་པར་བགྱིད་པའི་སེམས་ཅན་དེ་དག་ལ་ནི་བདག་གིས་ཀྱང་བསྙེན་བཀུར་དང་གཡོག་བགྱིའོ།
en: Bhagavān, I will venerate and serve whoever develops faith in these names, which are difficult to develop trust in.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སློབ་དཔོན་ལུང་སྟོན་པ་ཀཽཎྜི་ནྱ་ལེགས་སོ་ལེགས་སོ།
en: The Bhagavān replied, “Excellent, master grammarian Kauṇḍinya, excellent!

source: །ཁྱོད་ཀྱིས་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་དེ་དག་གི་ཕྱིར་ཡང་དག་པའི་སྒྲུབ་པ་དམ་བཅས་པ་ལེགས་སོ།
en: It is excellent that you have made such a promise for the sake of those noble sons and daughters.

source: །སློབ་དཔོན་ལུང་སྟོན་པ་ཀཽཎྜི་ནྱ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འདི་དག་གི་མཚན་རྣམས་འཆང་བ་ལ་ནི་གང་དང་གང་ལས་འཇིགས་པ་བྱུང་བ་ཐམས་ཅད་དེ་དང་དེ་ཉིད་དུ་རབ་ཏུ་ཞི་བར་འགྱུར་ཏེ།
en: Moreover, master grammarian Kauṇḍinya, when one bears in mind the names of all these tathāgata, foe-destroyer, complete and perfect buddhas, then each and every source of fearfulness will be quelled completely.

source: དེ་དག་འཆང་བ་ལ་ནི་ལྷ་རྣམས་ཀྱང་སྲུང་ངོ་། །ཀླུ་རྣམས་ཀྱང་སྲུང་ངོ་། །གནོད་སྦྱིན་རྣམས་ཀྱང་སྲུང་ངོ་། །དེ་བཞིན་གཤེགས་པའི་བར་དུ་ཡང་སྲུང་བར་མཛད་དོ།
en: When someone bears these names in mind, gods will protect them, nāgas will protect them, yakṣas will protect them, and so forth all the way up to the tathāgatas, who will also protect them.”

source: །དེ་ནས་འཁོར་ཆེན་པོའི་ནང་ནས་ལྷའི་བུ་མཐོང་ན་དགའ་བ་དྲི་ཟའི་རྒྱལ་པོ་ཞེས་བྱ་བས།
en: Then, out of the great assembly rose a devaputra named Gandharva King Delightful Appearance.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །ྟོ
en: He prostrated, touching his head to the Bhagavān’s feet, and then addressed the Bhagavān, saying,

source: ཀྱེ་མ་བཅོམ་ལྡན་འདས་ཚུལ་འདི་འདྲ་བའི་དེ་བཞིན་གཤེགས་པ་དེ་དག་དང་། ཚུལ་འདི་འདྲ་བའི་མདོ་རྣམས་དེ་བཞིན་གཤེགས་པ་འདས་པའི་འོག་ཏུ་སུ་དག་འཆང་བར་འགྱུར།
en: “Ah, Bhagavān! After the Tathāgata passes into nirvāṇa, who will be able to bear in mind such tathāgatas as these and such discourses as these?

source: སེམས་ཅན་ཇི་ལྟ་བུ་དག་འཆང་བར་འགྱུར།
en: What kinds of sentient beings will be able to maintain them?

source: སེམས་ཅན་ཇི་ལྟ་བུ་དག་གིས་ནི་ནུབ་པར་བགྱིད་པར་འགྱུར།
en: What kinds of sentient beings will cause them to disappear?”

source: དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོས་ལྷའི་བུ་མཐོང་ན་དགའ་བ་དྲི་ཟའི་རྒྱལ་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་མེད་དེ། ཆོས་ཀྱང་ནུབ་པར་མི་འགྱུར་རོ།
en: Then, through the Buddha’s power, the venerable Mahākāśyapa addressed the devaputra Gandharva King Delightful Appearance, saying, “Noble child, there is no passing into parinirvāṇa for any of the tathāgata, foe-destroyer, complete and perfect buddhas, and the Dharma will not disappear.”

source: །དེ་ནས་ལྷའི་བུ་མཐོང་ན་དགའ་བ་དྲི་ཟའི་རྒྱལ་པོས་གནས་བརྟན་འོད་སྲུང་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་འོད་སྲུང་ཆེན་པོ་སེམས་ཅན་སེམས་འཁྲུལ་པ་རྣམས་ལ་ཕན་གདགས་པའི་ཕྱིར་ཤོད་ཅིག །
en: At this point, the devaputra Gandharva King Delightful Appearance addressed Mahākāśyapa, saying, “Venerable Mahākāśyapa, in order to benefit all confused sentient beings, please give an explanation!

source: བཙུན་པ་འོད་སྲུང་ཆེན་པོ་སེམས་ཅན་ཐེ་ཙོམ་དུ་གྱུར་པ་རྣམས་ལ་ཤེས་པའི་སྒྲོན་མ་འབར་བར་གྱིས་ཤིག་དང་།
en: Venerable Mahākāśyapa, please light the lamp of knowledge for those sentient beings who have doubts!

source: བཙུན་པ་འོད་སྲུང་བདག་གིས་ཀྱང་མ་འོངས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་རྒྱས་པར་བགྱིའོ།
en: Venerable Mahākāśyapa, in the future I will also broadly proclaim the greatness of the Tathāgata’s virtuous qualities.”
